TexasInstruments/mcal_am263x/mcal/include/hw/am273/hw_mcanss.h
/*
* hw_mcanss.h
*
* Register-level header file for MCANSS2P0
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the
*    distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
*/
#ifndef HW_MCANSS_H_
#define HW_MCANSS_H_

#ifdef __cplusplus
extern "C"
{
#endif

/*This is a false error report in LDRA for 61 X "Identifier match in
  * 31 characters ". Adding LDRA no analysis for this part of the
  * code to improve the readability  */
  /*LDRA_NOANALYSIS*/
/****************************************************************************************************
* User Definitions
****************************************************************************************************/
/* MCAN IP related Macros */
#define MCAN_TX_BUFFER_MAX_NUM                             (32U)
#define MCAN_RX_BUFFER_MAX_NUM                             (64U)
#define MCAN_RX_FIFO_0_MAX_NUM                             (64U)
#define MCAN_RX_FIFO_1_MAX_NUM                             (64U)
#define MCAN_STD_FILTER_MAX_NUM                         (128U)
#define MCAN_EXT_FILTER_MAX_NUM                         (64U)
/* MCAL Related macros */
#define MCAN_TX_MB_MAX_NUM                                 (32U)
#define MCAN_RX_MB_MAX_NUM                                 (32U)

/****************************************************************************************************
* Register Definitions
****************************************************************************************************/


#define ECC_MEM_OFFSET                                     (0xF7F800U)
#define CFG_WRAP_OFFSET                                    (0xF3FC00U)
#define CFG_CORE_OFFSET                                    (0xF3FE00U)
#define RAM_MEM_OFFSET                                     (0x0U)
#define MCAN_RAM_OFFSET                                    (0x00040000U)
#define MCAN_RAM_OFFSET_SHIFT                              (0x0U)


#define MCAN_MCANSS_PID                                    (CFG_WRAP_OFFSET + 0x00U)
#define MCAN_MCANSS_CTRL                                   (CFG_WRAP_OFFSET + 0x04U)
#define MCAN_MCANSS_STAT                                   (CFG_WRAP_OFFSET + 0x08U)
#define MCAN_MCANSS_ICS                                    (CFG_WRAP_OFFSET + 0x0cU)
#define MCAN_MCANSS_IRS                                    (CFG_WRAP_OFFSET + 0x10U)
#define MCAN_MCANSS_IECS                                   (CFG_WRAP_OFFSET + 0x14U)
#define MCAN_MCANSS_IE                                     (CFG_WRAP_OFFSET + 0x18U)
#define MCAN_MCANSS_IES                                    (CFG_WRAP_OFFSET + 0x1cU)
#define MCAN_MCANSS_EOI                                    (CFG_WRAP_OFFSET + 0x20U)
#define MCAN_MCANSS_EXT_TS_PRESCALER                       (CFG_WRAP_OFFSET + 0x24U)
#define MCAN_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR            (CFG_WRAP_OFFSET + 0x28U)
#define MCAN_ECC_EOI                                       (CFG_WRAP_OFFSET + 0x80U)
#define MCAN_CREL                                          (CFG_CORE_OFFSET + 0x00U)
#define MCAN_ENDN                                          (CFG_CORE_OFFSET + 0x04U)
#define MCAN_CUST                                          (CFG_CORE_OFFSET + 0x08U)
#define MCAN_DBTP                                          (CFG_CORE_OFFSET + 0x0cU)
#define MCAN_TEST                                          (CFG_CORE_OFFSET + 0x10U)
#define MCAN_RWD                                           (CFG_CORE_OFFSET + 0x14U)
#define MCAN_CCCR                                          (CFG_CORE_OFFSET + 0x18U)
#define MCAN_NBTP                                          (CFG_CORE_OFFSET + 0x1cU)
#define MCAN_TSCC                                          (CFG_CORE_OFFSET + 0x20U)
#define MCAN_TSCV                                          (CFG_CORE_OFFSET + 0x24U)
#define MCAN_TOCC                                          (CFG_CORE_OFFSET + 0x28U)
#define MCAN_TOCV                                          (CFG_CORE_OFFSET + 0x2cU)
#define MCAN_ECR                                           (CFG_CORE_OFFSET + 0x40U)
#define MCAN_PSR                                           (CFG_CORE_OFFSET + 0x44U)
#define MCAN_TDCR                                          (CFG_CORE_OFFSET + 0x48U)
#define MCAN_IR                                            (CFG_CORE_OFFSET + 0x50U)
#define MCAN_IE                                            (CFG_CORE_OFFSET + 0x54U)
#define MCAN_ILS                                           (CFG_CORE_OFFSET + 0x58U)
#define MCAN_ILE                                           (CFG_CORE_OFFSET + 0x5cU)
#define MCAN_GFC                                           (CFG_CORE_OFFSET + 0x80U)
#define MCAN_SIDFC                                         (CFG_CORE_OFFSET + 0x84U)
#define MCAN_XIDFC                                         (CFG_CORE_OFFSET + 0x88U)
#define MCAN_XIDAM                                         (CFG_CORE_OFFSET + 0x90U)
#define MCAN_HPMS                                          (CFG_CORE_OFFSET + 0x94U)
#define MCAN_NDAT1                                         (CFG_CORE_OFFSET + 0x98U)
#define MCAN_NDAT2                                         (CFG_CORE_OFFSET + 0x9cU)
#define MCAN_RXF0C                                         (CFG_CORE_OFFSET + 0xa0U)
#define MCAN_RXF0S                                         (CFG_CORE_OFFSET + 0xa4U)
#define MCAN_RXF0A                                         (CFG_CORE_OFFSET + 0xa8U)
#define MCAN_RXBC                                          (CFG_CORE_OFFSET + 0xacU)
#define MCAN_RXF1C                                         (CFG_CORE_OFFSET + 0xb0U)
#define MCAN_RXF1S                                         (CFG_CORE_OFFSET + 0xb4U)
#define MCAN_RXF1A                                         (CFG_CORE_OFFSET + 0xb8U)
#define MCAN_RXESC                                         (CFG_CORE_OFFSET + 0xbcU)
#define MCAN_TXBC                                          (CFG_CORE_OFFSET + 0xc0U)
#define MCAN_TXFQS                                         (CFG_CORE_OFFSET + 0xc4U)
#define MCAN_TXESC                                         (CFG_CORE_OFFSET + 0xc8U)
#define MCAN_TXBRP                                         (CFG_CORE_OFFSET + 0xccU)
#define MCAN_TXBAR                                         (CFG_CORE_OFFSET + 0xd0U)
#define MCAN_TXBCR                                         (CFG_CORE_OFFSET + 0xd4U)
#define MCAN_TXBTO                                         (CFG_CORE_OFFSET + 0xd8U)
#define MCAN_TXBCF                                         (CFG_CORE_OFFSET + 0xdcU)
#define MCAN_TXBTIE                                        (CFG_CORE_OFFSET + 0xe0U)
#define MCAN_TXBCIE                                        (CFG_CORE_OFFSET + 0xe4U)
#define MCAN_TXEFC                                         (CFG_CORE_OFFSET + 0xf0U)
#define MCAN_TXEFS                                         (CFG_CORE_OFFSET + 0xf4U)
#define MCAN_TXEFA                                         (CFG_CORE_OFFSET + 0xf8U)
#define MCAN_ECC_AGGR_REVISION                             (ECC_MEM_OFFSET + 0x00U)
#define MCAN_ECC_AGGR_VECTOR                               (ECC_MEM_OFFSET + 0x08U)
#define MCAN_ECC_AGGR_MISC_STATUS                          (ECC_MEM_OFFSET + 0x0cU)
#define MCAN_ECC_AGGR_WRAP_REVISION                        (ECC_MEM_OFFSET + 0x10U)
#define MCAN_ECC_AGGR_CONTROL                              (ECC_MEM_OFFSET + 0x14U)
#define MCAN_ECC_AGGR_ERROR_CTRL1                          (ECC_MEM_OFFSET + 0x18U)
#define MCAN_ECC_AGGR_ERROR_CTRL2                          (ECC_MEM_OFFSET + 0x1cU)
#define MCAN_ECC_AGGR_ERROR_STATUS1                        (ECC_MEM_OFFSET + 0x20U)
#define MCAN_ECC_AGGR_ERROR_STATUS2                        (ECC_MEM_OFFSET + 0x24U)
#define MCAN_ECC_AGGR_SEC_EOI_REG                          (ECC_MEM_OFFSET + 0x3cU)
#define MCAN_ECC_AGGR_SEC_STATUS_REG0                      (ECC_MEM_OFFSET + 0x40U)
#define MCAN_ECC_AGGR_SEC_ENABLE_SET_REG0                  (ECC_MEM_OFFSET + 0x80U)
#define MCAN_ECC_AGGR_SEC_ENABLE_CLR_REG0                  (ECC_MEM_OFFSET + 0xc0U)
#define MCAN_ECC_AGGR_DED_EOI_REG                          (ECC_MEM_OFFSET + 0x13cU)
#define MCAN_ECC_AGGR_DED_STATUS_REG0                      (ECC_MEM_OFFSET + 0x140U)
#define MCAN_ECC_AGGR_DED_ENABLE_SET_REG0                  (ECC_MEM_OFFSET + 0x180U)
#define MCAN_ECC_AGGR_DED_ENABLE_CLR_REG0                  (ECC_MEM_OFFSET + 0x1c0U)
#define MCAN_MCAN_MSG_MEM                                  (RAM_MEM_OFFSET)


/****************************************************************************************************
* Field Definition Macros
****************************************************************************************************/

#define MCAN_MCANSS_PID_MINOR_SHIFT                        (0U)
#define MCAN_MCANSS_PID_MINOR_MASK                         (0x0000003fU)

#define MCAN_MCANSS_PID_CUSTOM_SHIFT                       (6U)
#define MCAN_MCANSS_PID_CUSTOM_MASK                        (0x000000c0U)

