TexasInstruments/mcal_am263x/mcal/include/hw/am273/hw_mcanss.h
#define MCAN_MCANSS_PID_MAJOR_SHIFT                        (8U)
#define MCAN_MCANSS_PID_MAJOR_MASK                         (0x00000700U)

#define MCAN_MCANSS_PID_RTL_SHIFT                          (11U)
#define MCAN_MCANSS_PID_RTL_MASK                           (0x0000f800U)

#define MCAN_MCANSS_PID_MODULE_ID_SHIFT                    (16U)
#define MCAN_MCANSS_PID_MODULE_ID_MASK                     (0x0fff0000U)

#define MCAN_MCANSS_PID_BU_SHIFT                           (28U)
#define MCAN_MCANSS_PID_BU_MASK                            (0x30000000U)

#define MCAN_MCANSS_PID_SCHEME_SHIFT                       (30U)
#define MCAN_MCANSS_PID_SCHEME_MASK                        (0xc0000000U)

#define MCAN_MCANSS_CTRL_RESET_SHIFT                       (0U)
#define MCAN_MCANSS_CTRL_RESET_MASK                        (0x00000001U)

#define MCAN_MCANSS_CTRL_CLKFACK_SHIFT                     (1U)
#define MCAN_MCANSS_CTRL_CLKFACK_MASK                      (0x00000002U)
#define MCAN_MCANSS_CTRL_CLKFACK_DISABLE                   (0U)
#define MCAN_MCANSS_CTRL_CLKFACK_ENABLE                    (1U)

#define MCAN_MCANSS_CTRL_EMUFACK_SHIFT                     (2U)
#define MCAN_MCANSS_CTRL_EMUFACK_MASK                      (0x00000004U)
#define MCAN_MCANSS_CTRL_EMUFACK_DISABLE                   (0U)
#define MCAN_MCANSS_CTRL_EMUFACK_ENABLE                    (1U)

#define MCAN_MCANSS_CTRL_EMUEN_SHIFT                       (3U)
#define MCAN_MCANSS_CTRL_EMUEN_MASK                        (0x00000008U)
#define MCAN_MCANSS_CTRL_EMUEN_DISABLE                     (0U)
#define MCAN_MCANSS_CTRL_EMUEN_ENABLE                      (1U)

#define MCAN_MCANSS_CTRL_WAKEUPREQEN_SHIFT                 (4U)
#define MCAN_MCANSS_CTRL_WAKEUPREQEN_MASK                  (0x00000010U)
#define MCAN_MCANSS_CTRL_WAKEUPREQEN_DISABLE               (0U)
#define MCAN_MCANSS_CTRL_WAKEUPREQEN_ENABLE                (1U)

#define MCAN_MCANSS_CTRL_AUTOWAKEUP_SHIFT                  (5U)
#define MCAN_MCANSS_CTRL_AUTOWAKEUP_MASK                   (0x00000020U)
#define MCAN_MCANSS_CTRL_AUTOWAKEUP_DISABLE                (0U)
#define MCAN_MCANSS_CTRL_AUTOWAKEUP_ENABLE                 (1U)

#define MCAN_MCANSS_CTRL_EXT_TS_CNTR_EN_SHIFT              (6U)
#define MCAN_MCANSS_CTRL_EXT_TS_CNTR_EN_MASK               (0x00000040U)

#define MCAN_MCANSS_STAT_RESET_SHIFT                       (0U)
#define MCAN_MCANSS_STAT_RESET_MASK                        (0x00000001U)

#define MCAN_MCANSS_STAT_MEM_INIT_DONE_SHIFT               (1U)
#define MCAN_MCANSS_STAT_MEM_INIT_DONE_MASK                (0x00000002U)

#define MCAN_MCANSS_STAT_ENABLE_FDOE_SHIFT                 (2U)
#define MCAN_MCANSS_STAT_ENABLE_FDOE_MASK                  (0x00000004U)

#define MCAN_MCANSS_ICS_EXT_TS_CNTR_OVFL_SHIFT             (0U)
#define MCAN_MCANSS_ICS_EXT_TS_CNTR_OVFL_MASK              (0x00000001U)

#define MCAN_MCANSS_IRS_EXT_TS_CNTR_OVFL_SHIFT             (0U)
#define MCAN_MCANSS_IRS_EXT_TS_CNTR_OVFL_MASK              (0x00000001U)

#define MCAN_MCANSS_IECS_EXT_TS_CNTR_OVFL_SHIFT            (0U)
#define MCAN_MCANSS_IECS_EXT_TS_CNTR_OVFL_MASK             (0x00000001U)

#define MCAN_MCANSS_IE_EXT_TS_CNTR_OVFL_SHIFT              (0U)
#define MCAN_MCANSS_IE_EXT_TS_CNTR_OVFL_MASK               (0x00000001U)

#define MCAN_MCANSS_IES_EXT_TS_CNTR_OVFL_SHIFT             (0U)
#define MCAN_MCANSS_IES_EXT_TS_CNTR_OVFL_MASK              (0x00000001U)

#define MCAN_MCANSS_EOI_SHIFT                              (0U)
#define MCAN_MCANSS_EOI_MASK                               (0x000000ffU)

#define MCAN_MCANSS_EXT_TS_PRESCALER_SHIFT                 (0U)
#define MCAN_MCANSS_EXT_TS_PRESCALER_MASK                  (0x00ffffffU)

#define MCAN_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR_SHIFT      (0U)
#define MCAN_MCANSS_EXT_TS_UNSERVICED_INTR_CNTR_MASK       (0x0000001fU)

#define MCAN_ECC_EOI_SHIFT                                 (8U)
#define MCAN_ECC_EOI_MASK                                  (0x00000100U)

#define MCAN_CREL_DAY_SHIFT                                (0U)
#define MCAN_CREL_DAY_MASK                                 (0x000000ffU)

#define MCAN_CREL_MON_SHIFT                                (8U)
#define MCAN_CREL_MON_MASK                                 (0x0000ff00U)

#define MCAN_CREL_YEAR_SHIFT                               (16U)
#define MCAN_CREL_YEAR_MASK                                (0x000f0000U)

#define MCAN_CREL_SUBSTEP_SHIFT                            (20U)
#define MCAN_CREL_SUBSTEP_MASK                             (0x00f00000U)

#define MCAN_CREL_STEP_SHIFT                               (24U)
#define MCAN_CREL_STEP_MASK                                (0x0f000000U)

#define MCAN_CREL_REL_SHIFT                                (28U)
#define MCAN_CREL_REL_MASK                                 (0xf0000000U)

#define MCAN_ENDN_ETV_SHIFT                                (0U)
#define MCAN_ENDN_ETV_MASK                                 (0xffffffffU)

#define MCAN_DBTP_DSJW_SHIFT                               (0U)
#define MCAN_DBTP_DSJW_MASK                                (0x0000000fU)

#define MCAN_DBTP_DTSEG2_SHIFT                             (4U)
#define MCAN_DBTP_DTSEG2_MASK                              (0x000000f0U)

#define MCAN_DBTP_DTSEG1_SHIFT                             (8U)
#define MCAN_DBTP_DTSEG1_MASK                              (0x00001f00U)

#define MCAN_DBTP_DBRP_SHIFT                               (16U)
#define MCAN_DBTP_DBRP_MASK                                (0x001f0000U)

#define MCAN_DBTP_TDC_SHIFT                                (23U)
#define MCAN_DBTP_TDC_MASK                                 (0x00800000U)
#define MCAN_DBTP_TDC_DISABLE                              (0U)
#define MCAN_DBTP_TDC_ENABLE                               (1U)

#define MCAN_TEST_LBCK_SHIFT                               (4U)
#define MCAN_TEST_LBCK_MASK                                (0x00000010U)

#define MCAN_TEST_TX_SHIFT                                 (5U)
#define MCAN_TEST_TX_MASK                                  (0x00000060U)

#define MCAN_TEST_RX_SHIFT                                 (7U)
#define MCAN_TEST_RX_MASK                                  (0x00000080U)

