TexasInstruments/mcal_am263x/mcal/include/hw/am273/hw_mcanss.h
#define MCAN_RWD_WDC_SHIFT                                 (0U)
#define MCAN_RWD_WDC_MASK                                  (0x000000ffU)
#define MCAN_RWD_WDC_DISABLE                               (0U)

#define MCAN_RWD_WDV_SHIFT                                 (8U)
#define MCAN_RWD_WDV_MASK                                  (0x0000ff00U)

#define MCAN_CCCR_INIT_SHIFT                               (0U)
#define MCAN_CCCR_INIT_MASK                                (0x00000001U)
#define MCAN_CCCR_INIT_MODE_NORMAL                         (0U)
#define MCAN_CCCR_INIT_MODE_INIT                           (1U)

#define MCAN_CCCR_CCE_SHIFT                                (1U)
#define MCAN_CCCR_CCE_MASK                                 (0x00000002U)

#define MCAN_CCCR_ASM_SHIFT                                (2U)
#define MCAN_CCCR_ASM_MASK                                 (0x00000004U)

#define MCAN_CCCR_CSA_SHIFT                                (3U)
#define MCAN_CCCR_CSA_MASK                                 (0x00000008U)
#define MCAN_CCCR_CSA_NO_ACK                               (0U)
#define MCAN_CCCR_CSA_ACK                                  (1U)

#define MCAN_CCCR_CSR_SHIFT                                (4U)
#define MCAN_CCCR_CSR_MASK                                 (0x00000010U)

#define MCAN_CCCR_MON_SHIFT                                (5U)
#define MCAN_CCCR_MON_MASK                                 (0x00000020U)

#define MCAN_CCCR_DAR_SHIFT                                (6U)
#define MCAN_CCCR_DAR_MASK                                 (0x00000040U)
#define MCAN_CCCR_DAR_DISABLE                              (0U)
#define MCAN_CCCR_DAR_ENABLE                               (1U)

#define MCAN_CCCR_TEST_SHIFT                               (7U)
#define MCAN_CCCR_TEST_MASK                                (0x00000080U)

#define MCAN_CCCR_FDOE_SHIFT                               (8U)
#define MCAN_CCCR_FDOE_MASK                                (0x00000100U)
#define MCAN_CCCR_FDOE_DISABLE                             (0U)
#define MCAN_CCCR_FDOE_ENABLE                              (1U)

#define MCAN_CCCR_BRSE_SHIFT                               (9U)
#define MCAN_CCCR_BRSE_MASK                                (0x00000200U)
#define MCAN_CCCR_BRSE_DISABLE                             (0U)
#define MCAN_CCCR_BRSE_ENABLE                              (1U)

#define MCAN_CCCR_PXHD_SHIFT                               (12U)
#define MCAN_CCCR_PXHD_MASK                                (0x00001000U)
#define MCAN_CCCR_PXHD_DISABLE                             (1U)
#define MCAN_CCCR_PXHD_ENABLE                              (0U)

#define MCAN_CCCR_EFBI_SHIFT                               (13U)
#define MCAN_CCCR_EFBI_MASK                                (0x00002000U)
#define MCAN_CCCR_EFBI_DISABLE                             (0U)
#define MCAN_CCCR_EFBI_ENABLE                              (1U)

#define MCAN_CCCR_TXP_SHIFT                                (14U)
#define MCAN_CCCR_TXP_MASK                                 (0x00004000U)
#define MCAN_CCCR_TXP_DISABLE                              (0U)
#define MCAN_CCCR_TXP_ENABLE                               (1U)

#define MCAN_NBTP_NTSEG2_SHIFT                             (0U)
#define MCAN_NBTP_NTSEG2_MASK                              (0x0000007fU)

#define MCAN_NBTP_NTSEG1_SHIFT                             (8U)
#define MCAN_NBTP_NTSEG1_MASK                              (0x0000ff00U)

#define MCAN_NBTP_NBRP_SHIFT                               (16U)
#define MCAN_NBTP_NBRP_MASK                                (0x01ff0000U)

#define MCAN_NBTP_NSJW_SHIFT                               (25U)
#define MCAN_NBTP_NSJW_MASK                                (0xfe000000U)

#define MCAN_TSCC_TSS_SHIFT                                (0U)
#define MCAN_TSCC_TSS_MASK                                 (0x00000003U)

#define MCAN_TSCC_TCP_SHIFT                                (16U)
#define MCAN_TSCC_TCP_MASK                                 (0x000f0000U)

#define MCAN_TSCV_TSC_SHIFT                                (0U)
#define MCAN_TSCV_TSC_MASK                                 (0x0000ffffU)

#define MCAN_TOCC_ETOC_SHIFT                               (0U)
#define MCAN_TOCC_ETOC_MASK                                (0x00000001U)

#define MCAN_TOCC_TOS_SHIFT                                (1U)
#define MCAN_TOCC_TOS_MASK                                 (0x00000006U)

#define MCAN_TOCC_TOP_SHIFT                                (16U)
#define MCAN_TOCC_TOP_MASK                                 (0xffff0000U)

#define MCAN_TOCV_TOC_SHIFT                                (0U)
#define MCAN_TOCV_TOC_MASK                                 (0x0000ffffU)

#define MCAN_ECR_TEC_SHIFT                                 (0U)
#define MCAN_ECR_TEC_MASK                                  (0x000000ffU)

#define MCAN_ECR_REC_SHIFT                                 (8U)
#define MCAN_ECR_REC_MASK                                  (0x00007f00U)

#define MCAN_ECR_RP_SHIFT                                  (15U)
#define MCAN_ECR_RP_MASK                                   (0x00008000U)

#define MCAN_ECR_CEL_SHIFT                                 (16U)
#define MCAN_ECR_CEL_MASK                                  (0x00ff0000U)

#define MCAN_PSR_LEC_SHIFT                                 (0U)
#define MCAN_PSR_LEC_MASK                                  (0x00000007U)

#define MCAN_PSR_ACT_SHIFT                                 (3U)
#define MCAN_PSR_ACT_MASK                                  (0x00000018U)

#define MCAN_PSR_EP_SHIFT                                  (5U)
#define MCAN_PSR_EP_MASK                                   (0x00000020U)

#define MCAN_PSR_EW_SHIFT                                  (6U)
#define MCAN_PSR_EW_MASK                                   (0x00000040U)

#define MCAN_PSR_BO_SHIFT                                  (7U)
#define MCAN_PSR_BO_MASK                                   (0x00000080U)
#define MCAN_PSR_BO_NO_BUS_OFF                             (0U)
#define MCAN_PSR_BO_BUS_OFF                                (1U)

#define MCAN_PSR_DLEC_SHIFT                                (8U)
#define MCAN_PSR_DLEC_MASK                                 (0x00000700U)

#define MCAN_PSR_RESI_SHIFT                                (11U)
#define MCAN_PSR_RESI_MASK                                 (0x00000800U)

#define MCAN_PSR_RBRS_SHIFT                                (12U)
#define MCAN_PSR_RBRS_MASK                                 (0x00001000U)

#define MCAN_PSR_RFDF_SHIFT                                (13U)
#define MCAN_PSR_RFDF_MASK                                 (0x00002000U)

#define MCAN_PSR_PXE_SHIFT                                 (14U)
#define MCAN_PSR_PXE_MASK                                  (0x00004000U)

#define MCAN_PSR_TDCV_SHIFT                                (16U)
#define MCAN_PSR_TDCV_MASK                                 (0x007f0000U)

#define MCAN_TDCR_TDCF_SHIFT                               (0U)
#define MCAN_TDCR_TDCF_MASK                                (0x0000007fU)

