TexasInstruments/mcal_am263x/mcal/include/hw/am273/hw_mcanss.h
#define MCAN_TDCR_TDCO_SHIFT                               (8U)
#define MCAN_TDCR_TDCO_MASK                                (0x00007f00U)

#define MCAN_IR_RF0N_SHIFT                                 (0U)
#define MCAN_IR_RF0N_MASK                                  (0x00000001U)

#define MCAN_IR_RF0W_SHIFT                                 (1U)
#define MCAN_IR_RF0W_MASK                                  (0x00000002U)

#define MCAN_IR_RF0F_SHIFT                                 (2U)
#define MCAN_IR_RF0F_MASK                                  (0x00000004U)

#define MCAN_IR_RF0L_SHIFT                                 (3U)
#define MCAN_IR_RF0L_MASK                                  (0x00000008U)

#define MCAN_IR_RF1N_SHIFT                                 (4U)
#define MCAN_IR_RF1N_MASK                                  (0x00000010U)

#define MCAN_IR_RF1W_SHIFT                                 (5U)
#define MCAN_IR_RF1W_MASK                                  (0x00000020U)

#define MCAN_IR_RF1F_SHIFT                                 (6U)
#define MCAN_IR_RF1F_MASK                                  (0x00000040U)

#define MCAN_IR_RF1L_SHIFT                                 (7U)
#define MCAN_IR_RF1L_MASK                                  (0x00000080U)

#define MCAN_IR_HPM_SHIFT                                  (8U)
#define MCAN_IR_HPM_MASK                                   (0x00000100U)

#define MCAN_IR_TC_SHIFT                                   (9U)
#define MCAN_IR_TC_MASK                                    (0x00000200U)

#define MCAN_IR_TCF_SHIFT                                  (10U)
#define MCAN_IR_TCF_MASK                                   (0x00000400U)

#define MCAN_IR_TFE_SHIFT                                  (11U)
#define MCAN_IR_TFE_MASK                                   (0x00000800U)

#define MCAN_IR_TEFN_SHIFT                                 (12U)
#define MCAN_IR_TEFN_MASK                                  (0x00001000U)

#define MCAN_IR_TEFW_SHIFT                                 (13U)
#define MCAN_IR_TEFW_MASK                                  (0x00002000U)

#define MCAN_IR_TEFF_SHIFT                                 (14U)
#define MCAN_IR_TEFF_MASK                                  (0x00004000U)

#define MCAN_IR_TEFL_SHIFT                                 (15U)
#define MCAN_IR_TEFL_MASK                                  (0x00008000U)

#define MCAN_IR_TSW_SHIFT                                  (16U)
#define MCAN_IR_TSW_MASK                                   (0x00010000U)

#define MCAN_IR_MRAF_SHIFT                                 (17U)
#define MCAN_IR_MRAF_MASK                                  (0x00020000U)

#define MCAN_IR_TOO_SHIFT                                  (18U)
#define MCAN_IR_TOO_MASK                                   (0x00040000U)

#define MCAN_IR_DRX_SHIFT                                  (19U)
#define MCAN_IR_DRX_MASK                                   (0x00080000U)

#define MCAN_IR_BEC_SHIFT                                  (20U)
#define MCAN_IR_BEC_MASK                                   (0x00100000U)

#define MCAN_IR_BEU_SHIFT                                  (21U)
#define MCAN_IR_BEU_MASK                                   (0x00200000U)

#define MCAN_IR_ELO_SHIFT                                  (22U)
#define MCAN_IR_ELO_MASK                                   (0x00400000U)

#define MCAN_IR_EP_SHIFT                                   (23U)
#define MCAN_IR_EP_MASK                                    (0x00800000U)

#define MCAN_IR_EW_SHIFT                                   (24U)
#define MCAN_IR_EW_MASK                                    (0x01000000U)

#define MCAN_IR_BO_SHIFT                                   (25U)
#define MCAN_IR_BO_MASK                                    (0x02000000U)

#define MCAN_IR_WDI_SHIFT                                  (26U)
#define MCAN_IR_WDI_MASK                                   (0x04000000U)

#define MCAN_IR_PEA_SHIFT                                  (27U)
#define MCAN_IR_PEA_MASK                                   (0x08000000U)

#define MCAN_IR_PED_SHIFT                                  (28U)
#define MCAN_IR_PED_MASK                                   (0x10000000U)

#define MCAN_IR_ARA_SHIFT                                  (29U)
#define MCAN_IR_ARA_MASK                                   (0x20000000U)

#define MCAN_IE_RF0NE_SHIFT                                (0U)
#define MCAN_IE_RF0NE_MASK                                 (0x00000001U)

#define MCAN_IE_RF0WE_SHIFT                                (1U)
#define MCAN_IE_RF0WE_MASK                                 (0x00000002U)

#define MCAN_IE_RF0FE_SHIFT                                (2U)
#define MCAN_IE_RF0FE_MASK                                 (0x00000004U)

#define MCAN_IE_RF0LE_SHIFT                                (3U)
#define MCAN_IE_RF0LE_MASK                                 (0x00000008U)

#define MCAN_IE_RF1NE_SHIFT                                (4U)
#define MCAN_IE_RF1NE_MASK                                 (0x00000010U)

#define MCAN_IE_RF1WE_SHIFT                                (5U)
#define MCAN_IE_RF1WE_MASK                                 (0x00000020U)

#define MCAN_IE_RF1FE_SHIFT                                (6U)
#define MCAN_IE_RF1FE_MASK                                 (0x00000040U)

#define MCAN_IE_RF1LE_SHIFT                                (7U)
#define MCAN_IE_RF1LE_MASK                                 (0x00000080U)

#define MCAN_IE_HPME_SHIFT                                 (8U)
#define MCAN_IE_HPME_MASK                                  (0x00000100U)

#define MCAN_IE_TCE_SHIFT                                  (9U)
#define MCAN_IE_TCE_MASK                                   (0x00000200U)

#define MCAN_IE_TCFE_SHIFT                                 (10U)
#define MCAN_IE_TCFE_MASK                                  (0x00000400U)

#define MCAN_IE_TFEE_SHIFT                                 (11U)
#define MCAN_IE_TFEE_MASK                                  (0x00000800U)

#define MCAN_IE_TEFNE_SHIFT                                (12U)
#define MCAN_IE_TEFNE_MASK                                 (0x00001000U)

#define MCAN_IE_TEFWE_SHIFT                                (13U)
#define MCAN_IE_TEFWE_MASK                                 (0x00002000U)

