TexasInstruments/mcal_am263x/mcal/include/hw/am273/hw_mcanss.h
#define MCAN_RXF1C_F1OM_SHIFT                              (31U)
#define MCAN_RXF1C_F1OM_MASK                               (0x80000000U)

#define MCAN_RXF1S_F1FL_SHIFT                              (0U)
#define MCAN_RXF1S_F1FL_MASK                               (0x0000007fU)

#define MCAN_RXF1S_F1GI_SHIFT                              (8U)
#define MCAN_RXF1S_F1GI_MASK                               (0x00003f00U)

#define MCAN_RXF1S_F1PI_SHIFT                              (16U)
#define MCAN_RXF1S_F1PI_MASK                               (0x003f0000U)

#define MCAN_RXF1S_F1F_SHIFT                               (24U)
#define MCAN_RXF1S_F1F_MASK                                (0x01000000U)

#define MCAN_RXF1S_RF1L_SHIFT                              (25U)
#define MCAN_RXF1S_RF1L_MASK                               (0x02000000U)

#define MCAN_RXF1S_DMS_SHIFT                               (30U)
#define MCAN_RXF1S_DMS_MASK                                (0xc0000000U)

#define MCAN_RXF1A_F1AI_SHIFT                              (0U)
#define MCAN_RXF1A_F1AI_MASK                               (0x0000003fU)

#define MCAN_RXESC_F0DS_SHIFT                              (0U)
#define MCAN_RXESC_F0DS_MASK                               (0x00000007U)

#define MCAN_RXESC_F1DS_SHIFT                              (4U)
#define MCAN_RXESC_F1DS_MASK                               (0x00000070U)

#define MCAN_RXESC_RBDS_SHIFT                              (8U)
#define MCAN_RXESC_RBDS_MASK                               (0x00000700U)

#define MCAN_TXBC_TBSA_SHIFT                               (2U)
#define MCAN_TXBC_TBSA_MASK                                (0x0000fffcU)

#define MCAN_TXBC_NDTB_SHIFT                               (16U)
#define MCAN_TXBC_NDTB_MASK                                (0x003f0000U)

#define MCAN_TXBC_TFQS_SHIFT                               (24U)
#define MCAN_TXBC_TFQS_MASK                                (0x3f000000U)

#define MCAN_TXBC_TFQM_SHIFT                               (30U)
#define MCAN_TXBC_TFQM_MASK                                (0x40000000U)

#define MCAN_TXFQS_TFFL_SHIFT                              (0U)
#define MCAN_TXFQS_TFFL_MASK                               (0x0000003fU)

#define MCAN_TXFQS_TFGI_SHIFT                              (8U)
#define MCAN_TXFQS_TFGI_MASK                               (0x00001f00U)

#define MCAN_TXFQS_TFQPI_SHIFT                             (16U)
#define MCAN_TXFQS_TFQPI_MASK                              (0x001f0000U)

#define MCAN_TXFQS_TFQF_SHIFT                              (21U)
#define MCAN_TXFQS_TFQF_MASK                               (0x00200000U)

#define MCAN_TXESC_TBDS_SHIFT                              (0U)
#define MCAN_TXESC_TBDS_MASK                               (0x00000007U)

#define MCAN_TXBRP_TRP0_SHIFT                              (0U)
#define MCAN_TXBRP_TRP0_MASK                               (0x00000001U)

#define MCAN_TXBRP_TRP1_SHIFT                              (1U)
#define MCAN_TXBRP_TRP1_MASK                               (0x00000002U)

#define MCAN_TXBRP_TRP2_SHIFT                              (2U)
#define MCAN_TXBRP_TRP2_MASK                               (0x00000004U)

#define MCAN_TXBRP_TRP3_SHIFT                              (3U)
#define MCAN_TXBRP_TRP3_MASK                               (0x00000008U)

#define MCAN_TXBRP_TRP4_SHIFT                              (4U)
#define MCAN_TXBRP_TRP4_MASK                               (0x00000010U)

#define MCAN_TXBRP_TRP5_SHIFT                              (5U)
#define MCAN_TXBRP_TRP5_MASK                               (0x00000020U)

#define MCAN_TXBRP_TRP6_SHIFT                              (6U)
#define MCAN_TXBRP_TRP6_MASK                               (0x00000040U)

#define MCAN_TXBRP_TRP7_SHIFT                              (7U)
#define MCAN_TXBRP_TRP7_MASK                               (0x00000080U)

#define MCAN_TXBRP_TRP8_SHIFT                              (8U)
#define MCAN_TXBRP_TRP8_MASK                               (0x00000100U)

#define MCAN_TXBRP_TRP9_SHIFT                              (9U)
#define MCAN_TXBRP_TRP9_MASK                               (0x00000200U)

#define MCAN_TXBRP_TRP10_SHIFT                             (10U)
#define MCAN_TXBRP_TRP10_MASK                              (0x00000400U)

#define MCAN_TXBRP_TRP11_SHIFT                             (11U)
#define MCAN_TXBRP_TRP11_MASK                              (0x00000800U)

#define MCAN_TXBRP_TRP12_SHIFT                             (12U)
#define MCAN_TXBRP_TRP12_MASK                              (0x00001000U)

#define MCAN_TXBRP_TRP13_SHIFT                             (13U)
#define MCAN_TXBRP_TRP13_MASK                              (0x00002000U)

#define MCAN_TXBRP_TRP14_SHIFT                             (14U)
#define MCAN_TXBRP_TRP14_MASK                              (0x00004000U)

#define MCAN_TXBRP_TRP15_SHIFT                             (15U)
#define MCAN_TXBRP_TRP15_MASK                              (0x00008000U)

#define MCAN_TXBRP_TRP16_SHIFT                             (16U)
#define MCAN_TXBRP_TRP16_MASK                              (0x00010000U)

#define MCAN_TXBRP_TRP17_SHIFT                             (17U)
#define MCAN_TXBRP_TRP17_MASK                              (0x00020000U)

#define MCAN_TXBRP_TRP18_SHIFT                             (18U)
#define MCAN_TXBRP_TRP18_MASK                              (0x00040000U)

#define MCAN_TXBRP_TRP19_SHIFT                             (19U)
#define MCAN_TXBRP_TRP19_MASK                              (0x00080000U)

#define MCAN_TXBRP_TRP20_SHIFT                             (20U)
#define MCAN_TXBRP_TRP20_MASK                              (0x00100000U)

#define MCAN_TXBRP_TRP21_SHIFT                             (21U)
#define MCAN_TXBRP_TRP21_MASK                              (0x00200000U)

#define MCAN_TXBRP_TRP22_SHIFT                             (22U)
#define MCAN_TXBRP_TRP22_MASK                              (0x00400000U)

#define MCAN_TXBRP_TRP23_SHIFT                             (23U)
#define MCAN_TXBRP_TRP23_MASK                              (0x00800000U)

