TexasInstruments/mcal_am263x/mcal/include/hw/am273/hw_mcanss.h
#define MCAN_TXBTIE_TIE4_SHIFT                             (4U)
#define MCAN_TXBTIE_TIE4_MASK                              (0x00000010U)

#define MCAN_TXBTIE_TIE5_SHIFT                             (5U)
#define MCAN_TXBTIE_TIE5_MASK                              (0x00000020U)

#define MCAN_TXBTIE_TIE6_SHIFT                             (6U)
#define MCAN_TXBTIE_TIE6_MASK                              (0x00000040U)

#define MCAN_TXBTIE_TIE7_SHIFT                             (7U)
#define MCAN_TXBTIE_TIE7_MASK                              (0x00000080U)

#define MCAN_TXBTIE_TIE8_SHIFT                             (8U)
#define MCAN_TXBTIE_TIE8_MASK                              (0x00000100U)

#define MCAN_TXBTIE_TIE9_SHIFT                             (9U)
#define MCAN_TXBTIE_TIE9_MASK                              (0x00000200U)

#define MCAN_TXBTIE_TIE10_SHIFT                            (10U)
#define MCAN_TXBTIE_TIE10_MASK                             (0x00000400U)

#define MCAN_TXBTIE_TIE11_SHIFT                            (11U)
#define MCAN_TXBTIE_TIE11_MASK                             (0x00000800U)

#define MCAN_TXBTIE_TIE12_SHIFT                            (12U)
#define MCAN_TXBTIE_TIE12_MASK                             (0x00001000U)

#define MCAN_TXBTIE_TIE13_SHIFT                            (13U)
#define MCAN_TXBTIE_TIE13_MASK                             (0x00002000U)

#define MCAN_TXBTIE_TIE14_SHIFT                            (14U)
#define MCAN_TXBTIE_TIE14_MASK                             (0x00004000U)

#define MCAN_TXBTIE_TIE15_SHIFT                            (15U)
#define MCAN_TXBTIE_TIE15_MASK                             (0x00008000U)

#define MCAN_TXBTIE_TIE16_SHIFT                            (16U)
#define MCAN_TXBTIE_TIE16_MASK                             (0x00010000U)

#define MCAN_TXBTIE_TIE17_SHIFT                            (17U)
#define MCAN_TXBTIE_TIE17_MASK                             (0x00020000U)

#define MCAN_TXBTIE_TIE18_SHIFT                            (18U)
#define MCAN_TXBTIE_TIE18_MASK                             (0x00040000U)

#define MCAN_TXBTIE_TIE19_SHIFT                            (19U)
#define MCAN_TXBTIE_TIE19_MASK                             (0x00080000U)

#define MCAN_TXBTIE_TIE20_SHIFT                            (20U)
#define MCAN_TXBTIE_TIE20_MASK                             (0x00100000U)

#define MCAN_TXBTIE_TIE21_SHIFT                            (21U)
#define MCAN_TXBTIE_TIE21_MASK                             (0x00200000U)

#define MCAN_TXBTIE_TIE22_SHIFT                            (22U)
#define MCAN_TXBTIE_TIE22_MASK                             (0x00400000U)

#define MCAN_TXBTIE_TIE23_SHIFT                            (23U)
#define MCAN_TXBTIE_TIE23_MASK                             (0x00800000U)

#define MCAN_TXBTIE_TIE24_SHIFT                            (24U)
#define MCAN_TXBTIE_TIE24_MASK                             (0x01000000U)

#define MCAN_TXBTIE_TIE25_SHIFT                            (25U)
#define MCAN_TXBTIE_TIE25_MASK                             (0x02000000U)

#define MCAN_TXBTIE_TIE26_SHIFT                            (26U)
#define MCAN_TXBTIE_TIE26_MASK                             (0x04000000U)

#define MCAN_TXBTIE_TIE27_SHIFT                            (27U)
#define MCAN_TXBTIE_TIE27_MASK                             (0x08000000U)

#define MCAN_TXBTIE_TIE28_SHIFT                            (28U)
#define MCAN_TXBTIE_TIE28_MASK                             (0x10000000U)

#define MCAN_TXBTIE_TIE29_SHIFT                            (29U)
#define MCAN_TXBTIE_TIE29_MASK                             (0x20000000U)

#define MCAN_TXBTIE_TIE30_SHIFT                            (30U)
#define MCAN_TXBTIE_TIE30_MASK                             (0x40000000U)

#define MCAN_TXBTIE_TIE31_SHIFT                            (31U)
#define MCAN_TXBTIE_TIE31_MASK                             (0x80000000U)

#define MCAN_TXBCIE_CFIE0_SHIFT                            (0U)
#define MCAN_TXBCIE_CFIE0_MASK                             (0x00000001U)

#define MCAN_TXBCIE_CFIE1_SHIFT                            (1U)
#define MCAN_TXBCIE_CFIE1_MASK                             (0x00000002U)

#define MCAN_TXBCIE_CFIE2_SHIFT                            (2U)
#define MCAN_TXBCIE_CFIE2_MASK                             (0x00000004U)

#define MCAN_TXBCIE_CFIE3_SHIFT                            (3U)
#define MCAN_TXBCIE_CFIE3_MASK                             (0x00000008U)

#define MCAN_TXBCIE_CFIE4_SHIFT                            (4U)
#define MCAN_TXBCIE_CFIE4_MASK                             (0x00000010U)

#define MCAN_TXBCIE_CFIE5_SHIFT                            (5U)
#define MCAN_TXBCIE_CFIE5_MASK                             (0x00000020U)

#define MCAN_TXBCIE_CFIE6_SHIFT                            (6U)
#define MCAN_TXBCIE_CFIE6_MASK                             (0x00000040U)

#define MCAN_TXBCIE_CFIE7_SHIFT                            (7U)
#define MCAN_TXBCIE_CFIE7_MASK                             (0x00000080U)

#define MCAN_TXBCIE_CFIE8_SHIFT                            (8U)
#define MCAN_TXBCIE_CFIE8_MASK                             (0x00000100U)

#define MCAN_TXBCIE_CFIE9_SHIFT                            (9U)
#define MCAN_TXBCIE_CFIE9_MASK                             (0x00000200U)

#define MCAN_TXBCIE_CFIE10_SHIFT                           (10U)
#define MCAN_TXBCIE_CFIE10_MASK                            (0x00000400U)

#define MCAN_TXBCIE_CFIE11_SHIFT                           (11U)
#define MCAN_TXBCIE_CFIE11_MASK                            (0x00000800U)

#define MCAN_TXBCIE_CFIE12_SHIFT                           (12U)
#define MCAN_TXBCIE_CFIE12_MASK                            (0x00001000U)

#define MCAN_TXBCIE_CFIE13_SHIFT                           (13U)
#define MCAN_TXBCIE_CFIE13_MASK                            (0x00002000U)

#define MCAN_TXBCIE_CFIE14_SHIFT                           (14U)
#define MCAN_TXBCIE_CFIE14_MASK                            (0x00004000U)

#define MCAN_TXBCIE_CFIE15_SHIFT                           (15U)
#define MCAN_TXBCIE_CFIE15_MASK                            (0x00008000U)

