TexasInstruments/mcal_am263x/mcal/include/hw/am273/hw_mcanss.h
#define MCAN_ECC_AGGR_WRAP_REVISION_REVMIN_SHIFT                (0U)
#define MCAN_ECC_AGGR_WRAP_REVISION_REVMIN_MASK                 (0x0000003fU)

#define MCAN_ECC_AGGR_CONTROL_ECC_ENABLE_SHIFT                      (0U)
#define MCAN_ECC_AGGR_CONTROL_ECC_ENABLE_MASK                       (0x00000001U)
#define MCAN_ECC_AGGR_CONTROL_ECC_ENABLE_DISABLE                    (0U)
#define MCAN_ECC_AGGR_CONTROL_ECC_ENABLE_ENABLE                     (1U)

#define MCAN_ECC_AGGR_CONTROL_ECC_CHECK_SHIFT                       (1U)
#define MCAN_ECC_AGGR_CONTROL_ECC_CHECK_MASK                        (0x00000002U)
#define MCAN_ECC_AGGR_CONTROL_ECC_CHECK_DISABLE                     (0U)
#define MCAN_ECC_AGGR_CONTROL_ECC_CHECK_ENABLE                      (1U)

#define MCAN_ECC_AGGR_CONTROL_ENABLE_RMW_SHIFT                      (2U)
#define MCAN_ECC_AGGR_CONTROL_ENABLE_RMW_MASK                       (0x00000004U)
#define MCAN_ECC_AGGR_CONTROL_ENABLE_RMW_DISABLE                    (0U)
#define MCAN_ECC_AGGR_CONTROL_ENABLE_RMW_ENABLE                     (1U)

#define MCAN_ECC_AGGR_CONTROL_FORCE_SEC_SHIFT                       (3U)
#define MCAN_ECC_AGGR_CONTROL_FORCE_SEC_MASK                        (0x00000008U)

#define MCAN_ECC_AGGR_CONTROL_FORCE_DED_SHIFT                       (4U)
#define MCAN_ECC_AGGR_CONTROL_FORCE_DED_MASK                        (0x00000010U)

#define MCAN_ECC_AGGR_CONTROL_FORCE_N_ROW_SHIFT                     (5U)
#define MCAN_ECC_AGGR_CONTROL_FORCE_N_ROW_MASK                      (0x00000020U)

#define MCAN_ECC_AGGR_CONTROL_ERROR_ONCE_SHIFT                      (6U)
#define MCAN_ECC_AGGR_CONTROL_ERROR_ONCE_MASK                       (0x00000040U)

#define MCAN_ECC_AGGR_ERROR_CTRL1_ECC_ROW_SHIFT                     (0U)
#define MCAN_ECC_AGGR_ERROR_CTRL1_ECC_ROW_MASK                      (0x0000ffffU)

#define MCAN_ECC_AGGR_ERROR_CTRL1_ECC_BIT1_SHIFT                    (16U)
#define MCAN_ECC_AGGR_ERROR_CTRL1_ECC_BIT1_MASK                     (0xffff0000U)

#define MCAN_ECC_AGGR_ERROR_CTRL2_ECC_BIT2_SHIFT                    (0U)
#define MCAN_ECC_AGGR_ERROR_CTRL2_ECC_BIT2_MASK                     (0x0000ffffU)

#define MCAN_ECC_AGGR_ERROR_STATUS1_ECC_SEC_SHIFT                   (0U)
#define MCAN_ECC_AGGR_ERROR_STATUS1_ECC_SEC_MASK                    (0x00000001U)

#define MCAN_ECC_AGGR_ERROR_STATUS1_ECC_DED_SHIFT                   (1U)
#define MCAN_ECC_AGGR_ERROR_STATUS1_ECC_DED_MASK                    (0x00000002U)

#define MCAN_ECC_AGGR_ERROR_STATUS1_CLR_ECC_SEC_SHIFT               (8U)
#define MCAN_ECC_AGGR_ERROR_STATUS1_CLR_ECC_SEC_MASK                (0x00000100U)

#define MCAN_ECC_AGGR_ERROR_STATUS1_CLR_ECC_DED_SHIFT               (9U)
#define MCAN_ECC_AGGR_ERROR_STATUS1_CLR_ECC_DED_MASK                (0x00000200U)

#define MCAN_ECC_AGGR_ERROR_STATUS1_ECC_ROW_SHIFT                   (16U)
#define MCAN_ECC_AGGR_ERROR_STATUS1_ECC_ROW_MASK                    (0xffff0000U)

#define MCAN_ECC_AGGR_ERROR_STATUS2_ECC_BIT1_SHIFT                  (0U)
#define MCAN_ECC_AGGR_ERROR_STATUS2_ECC_BIT1_MASK                   (0x0000ffffU)

#define MCAN_ECC_AGGR_ERROR_STATUS2_ECC_BIT2_SHIFT                  (16U)
#define MCAN_ECC_AGGR_ERROR_STATUS2_ECC_BIT2_MASK                   (0xffff0000U)

#define MCAN_ECC_AGGR_SEC_EOI_REG_WR_SHIFT                          (0U)
#define MCAN_ECC_AGGR_SEC_EOI_REG_WR_MASK                           (0x00000001U)

#define MCAN_ECC_AGGR_SEC_STATUS_REG0_MSGMEM_PEND_SHIFT             (0U)
#define MCAN_ECC_AGGR_SEC_STATUS_REG0_MSGMEM_PEND_MASK              (0x00000001U)

#define MCAN_ECC_AGGR_SEC_ENABLE_SET_REG0_MSGMEM_SHIFT              (0U)
#define MCAN_ECC_AGGR_SEC_ENABLE_SET_REG0_MSGMEM_MASK               (0x00000001U)

#define MCAN_ECC_AGGR_SEC_ENABLE_CLR_REG0_MSGMEM_SHIFT              (0U)
#define MCAN_ECC_AGGR_SEC_ENABLE_CLR_REG0_MSGMEM_MASK               (0x00000001U)

#define MCAN_ECC_AGGR_DED_EOI_REG_WR_SHIFT                          (0U)
#define MCAN_ECC_AGGR_DED_EOI_REG_WR_MASK                           (0x00000001U)

#define MCAN_ECC_AGGR_DED_STATUS_REG0_MSGMEM_PEND_SHIFT             (0U)
#define MCAN_ECC_AGGR_DED_STATUS_REG0_MSGMEM_PEND_MASK              (0x00000001U)

#define MCAN_ECC_AGGR_DED_ENABLE_SET_REG0_MSGMEM_SHIFT              (0U)
#define MCAN_ECC_AGGR_DED_ENABLE_SET_REG0_MSGMEM_MASK               (0x00000001U)

#define MCAN_ECC_AGGR_DED_ENABLE_CLR_REG0_MSGMEM_SHIFT              (0U)
#define MCAN_ECC_AGGR_DED_ENABLE_CLR_REG0_MSGMEM_MASK               (0x00000001U)

#define MCAN_MCAN_MSG_MEM_SHIFT                            (0U)
#define MCAN_MCAN_MSG_MEM_MASK                             (0xffffffffU)

/* User defined ranges */
#define MCAN_DBTP_DSJW_MAX                                 (0xFU)
#define MCAN_DBTP_DTSEG2_MAX                               (0xFU)
#define MCAN_DBTP_DTSEG1_MAX                               (0x1FU)
#define MCAN_DBTP_DBRP_MAX                                 (0x1FU)

#define MCAN_NBTP_NSJW_MAX                                 (0x7FU)
#define MCAN_NBTP_NTSEG2_MAX                               (0x7FU)
#define MCAN_NBTP_NTSEG1_MAX                               (0xFFU)
#define MCAN_NBTP_NBRP_MAX                                 (0x1FFU)

#define MCAN_RWD_WDC_MAX                                   (0xFFU)

#define MCAN_TDCR_TDCF_MAX                                 (0x7FU)
#define MCAN_TDCR_TDCO_MAX                                 (0x7FU)

#define MCAN_XIDAM_EIDM_MAX                                (0x1FFFFFFFU)

#define MCAN_TSCC_TCP_MAX                                  (0xFU)

#define MCAN_TOCC_TOP_MAX                                  (0xFFFFU)

#define MCAN_NDAT1_CLEAR                                   (0xFFFFFFFFU)
#define MCAN_NDAT2_CLEAR                                   (0xFFFFFFFFU)

/*LDRA_ANALYSIS*/

#ifdef __cplusplus
}
#endif

#endif /* HW_MCANSS_H_ */

